# `rightmove_webscraper.py`
# Examples

In [1]:
from rightmove_webscraper import rightmove_data

## Example 1
### Scrape properties for sale:

Using a URL returned from searching rightmove.co.uk with the following criteria:

* Property for SALE
* Area = "Battersea Power Station"
* Radius = within 3 miles
* Price range, bedrooms = no min or max
* Property type = Any
* Added to site within =  last 7 days

In [2]:
sale_url = "https://www.rightmove.co.uk/property-for-sale/find.html?\
searchType=SALE&locationIdentifier=REGION%5E94346&insId=1&radius=3.0\
&minPrice=&maxPrice=&minBedrooms=&maxBedrooms=&displayPropertyType=\
&maxDaysSinceAdded=7&_includeSSTC=on&sortByPriceDescending=\
&primaryDisplayPropertyType=&secondaryDisplayPropertyType=\
&oldDisplayPropertyType=&oldPrimaryDisplayPropertyType=&newHome=&auction=false"

# Create the instance of the class on the search URL:
sale_object = rightmove_data(sale_url)
sale_object.results_count

1050

In [3]:
# `average_price` give the mean price of all results returned:
sale_object.average_price

1128377

In [4]:
# `summary` gives a summary by count and mean price:
sale_object.summary()

   number_bedrooms  count     mean
0                0     17  1108000
1                1    238   647736
2                2    460   909482
3                3    193  1467689
4                4    100  1969577
5                5     33  2681666
6                6      4  4512487

In [5]:
# By default `summary` is group by number of bedrooms, but can also be grouped  
# by different features:
sale_object.summary(by="postcode").head()

  postcode  count     mean
0     SW11     69   889485
1      SW6     51  1077016
2      SE1     45   990664
3      SW8     35   969724
4       W2     35  1260968

In [6]:
# `get_results` method returns all listings in a Pandas dataframe:
sale_object.get_results.tail()

,price,type,address,url,agent_url,postcode,number_bedrooms,search_date
1045,415000,2 bedroom flat for sale,"South City Court, London, London, SE15",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,SE15,2,2018-07-25 13:02:00.234429
1046,415000,1 bedroom flat for sale,"Wyneham Road, Herne Hill",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,NaN,1,2018-07-25 13:02:00.234429
1047,415000,1 bedroom flat for sale,"Poynders Road, Clapham South, London, SW4",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,SW4,1,2018-07-25 13:02:00.234429
1048,415000,1 bedroom flat for sale,"Laitwood Road, Balham",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,NaN,1,2018-07-25 13:02:00.234429
1049,415000,2 bedroom flat for sale,"Albion Avenue, London SW8",http://www.rightmove.co.uk/property-for-sale/p...,http://www.rightmove.co.uk/estate-agents/agent...,SW8,2,2018-07-25 13:02:00.234429

## Example 2
### Scrape properties for rent:

Using a URL returned from a same criteria as above, except searching for rental properties.

In [7]:
rent_url = "https://www.rightmove.co.uk/property-to-rent/find.html?\
searchType=RENT&locationIdentifier=REGION%5E94346&insId=1&radius=3.0&minPrice=\
&maxPrice=&minBedrooms=&maxBedrooms=&displayPropertyType=&maxDaysSinceAdded=7\
&sortByPriceDescending=&_includeLetAgreed=on&primaryDisplayPropertyType=\
&secondaryDisplayPropertyType=&oldDisplayPropertyType=\
&oldPrimaryDisplayPropertyType=&letType=&letFurnishType=&houseFlatShare="

# Create the instance of the class on the search URL:
rent_object = rightmove_data(rent_url)
rent_object.results_count

1050

In [8]:
rent_object.average_price

3241

In [9]:
rent_object.summary()

   number_bedrooms  count   mean
0                0     97   1360
1                1    305   2088
2                2    412   3100
3                3    154   5427
4                4     60   6004
5                5     12   9652
6                6      4   4854
7                7      1  21667

In [10]:
rent_object.summary(by="postcode").head()

  postcode  count  mean
0     SW11     66  2275
1      SW8     57  2509
2      SW6     53  2803
3       W2     51  3301
4      SW3     46  3980

In [11]:
rent_object.get_results.tail()

,price,type,address,url,agent_url,postcode,number_bedrooms,search_date
1045,2167,1 bedroom apartment,"The Corniche, Albert Embankment, London, SE1",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,SE1,1,2018-07-25 13:03:09.965945
1046,1950,1 bedroom flat,"Ormonde Gate, LONDON, SW3",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,SW3,1,2018-07-25 13:03:09.965945
1047,1842,2 bedroom apartment,"Fogerhill House, Ram Quarter, Wandsworth",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,NaN,2,2018-07-25 13:03:09.965945
1048,19500,2 bedroom apartment,"Hertford Street, Mayfair, W1",http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,W1,2,2018-07-25 13:03:09.965945
1049,1842,Studio apartment,Doulton House Park Street SW6,http://www.rightmove.co.uk/property-to-rent/pr...,http://www.rightmove.co.uk/estate-agents/agent...,SW6,0,2018-07-25 13:03:09.965945